Revit 2027 API
Application.LoginUserId Property
 The user id of the user currently logged in. The user id will be empty if the user is not logged in.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string LoginUserId { get; }
Public ReadOnly Property LoginUserId As String
	Get
public:
property String^ LoginUserId {
	String^ get ();
}
member LoginUserId : string with get
Property Value
String
Remarks
 The internal id of Autodesk ID that the current user has logged in to A360. This user id is in human unrecognizable form. In conjunction with the Store Entitlement REST API, a publisher of Autodesk Exchange Store app can verify if the current user has purchased their app from the store. For more information about Store Entitlement API, please refer to www.autodesk.com/developapps.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace